* Test Results

** PAST
*** v4-v17
   | version | bots | size | wins | total | score  |   
   | v4      | 2,3  |  1-5 |   55 |   110 | -      |   
   | v5      | 2,3  |  1-5 |   62 |   110 | -      |   
   | v6      | 2,3  |  1-5 |   65 |   110 | -      |   
   | v7      | 2,3  |  1-5 |   78 |   110 | -      |   
   | v8      | 2,3  |  1-5 |   79 |   110 | 360.78 |   
   | v9      | 2,3  |  1-5 |   74 |   110 | 348.36 |   
   |         |      |      |      |       |        |   
   --seeds  0
   | v10  |   2,3 | 1-5 | 85 | 110 |    379 |
   | v10  |   3-6 | 1-6 |    | 130 |        |
   | v11  |   2,3 | 1-5 | 86 | 110 |    381 |
   | v11  |   2-6 | 1-6 | 73 | 130 | 342.48 |
   | v11  |   3-6 | 1-6 | 57 | 130 |  296.3 |
   | v12  |   3-6 | 1-6 | 61 | 130 | 306.78 |
   | v13  |   3-6 | 1-6 | 64 | 130 |    319 |
   | v14  |   3-6 | 1-6 | 71 | 130 |  336.1 |
   | v14+ | 10-14 | 1-6 | 46 | 130 | 291.78 |
   | v15  | 10-14 | 1-6 | 50 | 130 | 302.08 |
   | v16  | 10-14 | 1-6 | 58 | 130 | 332.38 |
   | v17  | 10-14 | 1-6 | 60 | 130 | 336.88 |
   
*** v18
| seed |  bots | series | wins | totals |   score |
|    0 | 10-14 |    1-7 |   87 |    180 |  479.72 |
|    1 | 10-14 |    1-7 |   81 |    180 |  441.48 |
|    2 | 10-14 |    1-7 |   90 |    180 |  471.62 |
|      |       |        |  258 |        | 1392.82 |
#+TBLFM: $4=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v19
| seed |  bots | series | wins | totals |   score |
|    0 | 10-14 |    1-7 |   92 |    180 |  494.75 |
|    1 | 10-14 |    1-7 |   88 |    180 |     446 |
|    2 | 10-14 |    1-7 |   85 |    180 |  461.87 |
|      |       |        |  265 |        | 1402.62 |
#+TBLFM: $4=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v20
| seed |  bots | series | wins | totals |   score |
|    0 | 10-14 |    1-7 |   94 |    180 |   503.5 |
|    1 | 10-14 |    1-7 |   92 |    180 |   454.8 |
|    2 | 10-14 |    1-7 |   90 |    180 |  476.28 |
|      |       |        |  276 |        | 1434.58 |
#+TBLFM: $4=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v21
| seed |  bots | series | wins | totals |   score |
|    0 | 10-14 |    1-7 |   91 |    180 |  481.83 |
|    1 | 10-14 |    1-7 |   92 |    180 |   465.3 |
|    2 | 10-14 |    1-7 |  106 |    180 |   519.6 |
|      |       |        |  289 |    540 | 1466.73 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v22
| seed |  bots | series | wins | totals |   score |
|    0 | 10-14 |    1-7 |   97 |    180 |  498.35 |
|    1 | 10-14 |    1-7 |   96 |    180 |  474.35 |
|    2 | 10-14 |    1-7 |  112 |    180 |  526.27 |
|      |       |        |  305 |    540 | 1498.97 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v23 :mapDistributionChanged:uppedBots:
| seed |  bots | series | wins | totals |   score |
|    0 | 10-16 |    1-7 |  103 |    180 |  495.02 |
|    1 | 10-16 |    1-7 |   94 |    180 |  423.27 |
|    2 | 10-16 |    1-7 |   84 |    180 |  417.78 |
|      |       |        |  281 |    540 | 1336.07 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v24
| seed |  bots | series | wins | totals |   score |
|    0 | 10-16 |    1-7 |   93 |    180 |  406.77 |
|    1 | 10-16 |    1-7 |  104 |    180 |   488.6 |
|    2 | 10-16 |    1-7 |   93 |    180 |  478.98 |
|      |       |        |  290 |    540 | 1374.35 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v25
| seed |  bots | series | wins | totals |   score |
|    0 | 10-16 |    1-7 |  107 |    180 |   491.6 |
|    1 | 10-16 |    1-7 |  102 |    180 |  480.77 |
|    2 | 10-16 |    1-7 |  103 |    180 |   502.4 |
|      |       |        |  312 |    540 | 1474.77 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v26 :changedPlayerDistribution:
| seed |  bots | series | wins | totals |  score |
|    0 | 10-16 |    1-7 |  113 |    180 | 436.98 |
|    1 | 10-16 |    1-7 |  120 |    180 | 444.77 |
|    2 | 10-16 |    1-7 |  115 |    180 | 446.45 |
|      |       |        |  348 |    540 | 1328.2 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)


** CURRENT

*** v27
| seed |  bots | series | wins | totals |  score |
|    0 | 10-16 |    1-7 |  112 |    180 | 435.48 |
|    1 | 10-16 |    1-7 |  120 |    180 | 444.77 |
|    2 | 10-16 |    1-7 |  115 |    180 | 446.45 |
|      |       |        |  347 |    540 | 1326.7 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v28
| seed |  bots | series | wins | totals |   score |
|    0 | 10-16 |    1-7 |  122 |    180 |  464.83 |
|    1 | 10-16 |    1-7 |  116 |    180 |  443.65 |
|    2 | 10-16 |    1-7 |  118 |    180 |  445.87 |
|      |       |        |  356 |    540 | 1354.35 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)

*** v29
| seed |  bots | series | wins | totals |   score |
|    0 | 10-16 |    1-7 |  122 |    180 |   470.5 |
|    1 | 10-16 |    1-7 |  120 |    180 |  450.87 |
|    2 | 10-16 |    1-7 |  121 |    180 |     462 |
|      |       |        |  363 |    540 | 1383.37 |
#+TBLFM: $4=vsum(@2..@-1)::$5=vsum(@2..@-1)::$6=vsum(@2..@-1)
